Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПодтверждениеОперацийБэкОфиса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодтверждаемыеОперацииБэкОфиса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/Акцепт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Акцепт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АкцептованиеОпераций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАкцепта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАкцептов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУправленияДовереннымиСредствами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДоговораМНО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорМНО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФилиалаКредитнойОрганизации</Name>
					<Comment>Указывается для филиалов, </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ДепозитарныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДепозитарныеСчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненныеРазделы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попекаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПопечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСДокументамиКлиент/Ext/Module.bsl
// Анализируется необходимость детализации по расчетному счету в зависимости от значений реквизитов, связанных в регистре НастройкиУчетаБэкОфиса
Процедура ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(Форма) Экспорт 
	
	СвязанныеРеквизиты = Новый Структура("Дата, Организация, Брокер");
	ЗаполнитьЗначенияСвойств(СвязанныеРеквизиты, Форма.Объект); // передать на сервер объект нельзя, даже если его не менять, ругается "нельзя изменять поле содержащее объект данных формы"
	
	Форма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты);

	//Если ЗначениеЗаполнено(Форма.Объект.Брокер) Тогда
	//	Форма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты);
	//Иначе
	//	Форма.ДетализацияПоРасчетномуСчету = Истина;
	//КонецЕсли; 
	
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);

КонецПроцедуры // ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов

#Область ВЫБОР_ИСПОЛНИТЕЛЕЙ

Функция ВыбратьИсполнителяПоДенежнымСредствам(Форма, ИсполнителиБрокерские, СоответствиеРеквизитовИсполнителяИДокумента = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	
	ПараметрыФормыВыбора = Новый Структура("ВозвращатьВсеСведенияОбИсполнителе, Период, Организация, ИсполнителиБрокерские",
		Истина, Объект.Дата, Объект.Организация, ИсполнителиБрокерские);
		
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ПараметрыФормыВыбора.Вставить("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	КонецЕсли;
	
	ИмяРеквизитаСБрокером = "Брокер";
	Если ТипЗнч(СоответствиеРеквизитовИсполнителяИДокумента) = Тип("Структура") Тогда
		Если СоответствиеРеквизитовИсполнителяИДокумента.Свойство("Брокер") Тогда
			ИмяРеквизитаСБрокером = СоответствиеРеквизитовИсполнителяИДокумента["Брокер"];
		КонецЕсли;
	КонецЕсли;
	
	Если ((ИсполнителиБрокерские = Истина) Или (ИсполнителиБрокерские = 1)) И ЗначениеЗаполнено(Объект[ИмяРеквизитаСБрокером]) Тогда
		ПараметрыФормыВыбора.Вставить("Брокер", Объект[ИмяРеквизитаСБрокером]);
	КонецЕсли;
	
	ДанныеПоИсполнителю = ОткрытьФормуМодально("Справочник.БанковскиеСчета.Форма.ФормаВыбораИзИсполнителей", ПараметрыФормыВыбора, Форма);
	
	Если ТипЗнч(ДанныеПоИсполнителю) = Тип("Структура") Тогда
		Если ТипЗнч(СоответствиеРеквизитовИсполнителяИДокумента) = Тип("Структура") Тогда
			Для каждого КлючЗначение Из СоответствиеРеквизитовИсполнителяИДокумента Цикл
				Если Не ИсполнителиБрокерские И КлючЗначение.Ключ = "Брокер" Тогда
					Продолжить;
				Иначе
					Объект[КлючЗначение.Значение] = ДанныеПоИсполнителю[КлючЗначение.Ключ];
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЗаполнитьЗначенияСвойств(Объект, ДанныеПоИсполнителю);
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь; // выбор не был произведен
	
КонецФункции // ВыбратьИсполнителяПоДенежнымСредствам

// Отдельная функция для выбора из собственных исполнителей по всем портфелям клиента при переводе между портфелями внутри УК
// либо из банковских счетов контрагента при вводе/выводе клиенту или в другую УК
// Используется в документах ПоручениеНаПереводДенежныхСредств, ВводДенежныхСредств, ВыводДенежныхСредств
//
// Параметры:
//	Форма - форма документа
//  Контрагент - юр.физ лицо клиента или другой УК
//  ПереводВнутриУК - Булево, Истина при переводе между портфелями клиента внутри одной организации
//  СоответствиеРеквизитовИсполнителяИДокумента - Структура с именами реквизитов исполнителя (Ключ) и соответствующими именами реквизитов документа (Значение)
//  ИмяРеквизита - имя дополнительного реквизита документа, значение которого составляется из наименования владельца для документов, номера и даты договора ДУ
//
Функция ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(Форма, Контрагент, ПереводВнутриУК = Истина, СоответствиеРеквизитовИсполнителяИДокумента = Неопределено, ИмяРеквизита = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	
	Если ПереводВнутриУК Тогда
		ПараметрыФормыВыбора = Новый Структура("Период, Организация, Клиент",
			Объект.Дата, Объект.Организация, Контрагент);
			 		
		ДанныеПоКонтрагенту = ОткрытьФормуМодально("Справочник.БанковскиеСчета.Форма.ФормаВыбораДляПереводовМеждуПортфелями", ПараметрыФормыВыбора, Форма);
	Иначе
		ПараметрыФормыВыбора = Новый Структура("Организация, ЮрФизЛицо, ТолькоСчетаКлиента",
			Объект.Организация, Контрагент, Ложь);
			 		
		ДанныеДляЗаполнения = ОткрытьФормуМодально("Справочник.БанковскиеСчета.Форма.ФормаВыбораСчетаКлиента", ПараметрыФормыВыбора, Форма);
		
		// В этом случае получим ссылку на банковский счет
		Если ТипЗнч(ДанныеДляЗаполнения) = Тип("СправочникСсылка.БанковскиеСчета") Тогда		
			ДанныеПоКонтрагенту = Новый Структура("Контрагент, РасчетныйСчет", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаполнения, "ЮрФизЛицо"), ДанныеДляЗаполнения);
		Иначе
			ДанныеПоКонтрагенту = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПоКонтрагенту) = Тип("Структура") Тогда
		Если ТипЗнч(СоответствиеРеквизитовИсполнителяИДокумента) = Тип("Структура") Тогда
			Для каждого КлючЗначение Из СоответствиеРеквизитовИсполнителяИДокумента Цикл
				Объект[КлючЗначение.Значение] = ДанныеПоКонтрагенту[КлючЗначение.Ключ];
			КонецЦикла;
			
			Если ДанныеПоКонтрагенту.Свойство("Контрагент") Тогда
				Объект.Контрагент = ДанныеПоКонтрагенту.Контрагент;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(Объект, ДанныеПоКонтрагенту,, ?(ДанныеПоКонтрагенту.Свойство("СчетДоверительногоУправления"), "СчетДоверительногоУправления", Неопределено));
		КонецЕсли;
		
		Если ИмяРеквизита <> Неопределено Тогда
			Объект[ИмяРеквизита] = ДанныеПоКонтрагенту.НаименованиеВладельцаДляДокументов + ", договор ДУ " + СокрЛП(ДанныеПоКонтрагенту.НомерДоговора) + " от " + Формат(ДанныеПоКонтрагенту.ДатаЗаключения, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
		Возврат Истина;			
	КонецЕсли;
	
	Возврат Ложь; // выбор не был произведен
	
КонецФункции // ВыбратьИсполнителяПоДенежнымСредствамДляПереводаМеждуПортфелями

Функция ВыбратьИсполнителяПоЦеннымБумагам(Форма, ИсполнителиБрокерские = Ложь, ИмяКорзиныЦенныхБумаг = "") Экспорт
	
	Объект = Форма.Объект;
	
	ПараметрыФормыВыбора = Новый Структура("ВозвращатьВсеСведенияОбИсполнителе, Период, Организация, ИсполнителиБрокерские",
		Истина, Объект.Дата, Объект.Организация, ИсполнителиБрокерские);
		
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ПараметрыФормыВыбора.Вставить("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	КонецЕсли;
	
	Если ((ИсполнителиБрокерские = Истина) Или (ИсполнителиБрокерские = 1)) И ЗначениеЗаполнено(Объект.Брокер) Тогда
		ПараметрыФормыВыбора.Вставить("Брокер", Объект.Брокер);
	КонецЕсли;
	
	ДанныеПоИсполнителю = ОткрытьФормуМодально("Справочник.ДепозитарныеСчета.Форма.ФормаВыбораИзИсполнителей", ПараметрыФормыВыбора, Форма);
	
	Если ТипЗнч(ДанныеПоИсполнителю) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ДанныеПоИсполнителю);
		
		Если Не ПустаяСтрока(ИмяКорзиныЦенныхБумаг) Тогда
			Если Форма.КорзинаЦенныхБумаг Тогда
				Для каждого СтрокаКорзинаЦенныхБумаг Из Объект[ИмяКорзиныЦенныхБумаг] Цикл
					СтрокаКорзинаЦенныхБумаг.ДепозитарныйСчет = ДанныеПоИсполнителю.ДепозитарныйСчет;
				КонецЦикла;
			Иначе
				Форма[ИмяКорзиныЦенныхБумаг + "ДепозитарныйСчет" + 1] = ДанныеПоИсполнителю.ДепозитарныйСчет;
			КонецЕсли;
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь; // выбор не был произведен
	
КонецФункции // ВыбратьИсполнителяПоЦеннымБумагам

#КонецОбласти

Процедура ПроверитьПараметрыПодтвержденияОперации(Форма, Операция, ПараметрыЗаписи) Экспорт
	
	// Нас интересуют только проведения
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	// Только для организаций, для которых требуется подтверждение операций
	КонтрольПодтвержденийОпераций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция.Организация, "КонтрольПодтвержденийОпераций");
	Если Не КонтрольПодтвержденийОпераций Тогда
		Возврат;
	КонецЕсли;
	
	КрайниеЗаписи = РаботаСДокументами.ПолучитьКрайниеЗаписиЖурналаПодтверждений(Операция.Ссылка);	
	
	Если ЗначениеЗаполнено(КрайниеЗаписи.ПоследняяЗапись) Тогда
		
		ОднаЗаписьВЖурнале			= (КрайниеЗаписи.ПерваяЗапись.Период = КрайниеЗаписи.ПоследняяЗапись.Период);	
		КонецСледующегоРабочегоДня	= КонецДня(РаботаСДокументами.СледующийРабочийДень(Операция.Дата));	
		
		Если КрайниеЗаписи.ПоследняяЗапись.Подтверждена И КрайниеЗаписи.ПоследняяЗапись.Период > КонецСледующегоРабочегоДня Тогда		
			Если Вопрос("Время подтверждения позже, чем следующий рабочий день после дня операции. Изменить время подтверждения?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ПараметрыФормы = Новый Структура("КорректировкаЗаписи, Ключ", Истина, РаботаСДокументами.ПолучитьКлючЗаписиПодтвержденияОперации(Операция.Ссылка, КрайниеЗаписи.ПоследняяЗапись.Организация, КрайниеЗаписи.ПоследняяЗапись.Период));
				РезультатЗакрытия = ОткрытьФормуМодально("РегистрСведений.ПодтверждениеОперацийБэкОфиса.ФормаЗаписи", ПараметрыФормы, Форма);
			КонецЕсли;
		КонецЕсли;
		
		Если Не (ОднаЗаписьВЖурнале И КрайниеЗаписи.ПоследняяЗапись.Подтверждена) И КрайниеЗаписи.ПерваяЗапись.Период > КонецСледующегоРабочегоДня Тогда		
			Если Вопрос("Время внесения позже, чем следующий рабочий день после дня операции. Изменить время внесения?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ПараметрыФормы = Новый Структура("КорректировкаЗаписи, Ключ", Истина, РаботаСДокументами.ПолучитьКлючЗаписиПодтвержденияОперации(Операция.Ссылка, КрайниеЗаписи.ПерваяЗапись.Организация, КрайниеЗаписи.ПерваяЗапись.Период));
				РезультатЗакрытия = ОткрытьФормуМодально("РегистрСведений.ПодтверждениеОперацийБэкОфиса.ФормаЗаписи", ПараметрыФормы, Форма);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетДоверительногоУправленияПриИзменении(СчетДоверительногоУправления, Форма) Экспорт
	
	СчетДляУчета = РаботаСДокументами.ПолучитьСчетДляУчета(СчетДоверительногоУправления);
	Если СчетДляУчета = Неопределено Тогда // значит, учет ведется раздельно и нужно выбирать стратегию
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нужно выбирать субпортфели!", Форма, "СчетДоверительногоУправления");
		СчетДоверительногоУправления = Неопределено;
		
	ИначеЕсли СчетДляУчета <> СчетДоверительногоУправления Тогда // значит, учет ведется консолидированно и нужно выбирать договор
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выбирать субпортфели!", Форма, "СчетДоверительногоУправления");
		СчетДоверительногоУправления = Неопределено;
		
	КонецЕсли;

КонецПроцедуры

Процедура СчетДоверительногоУправленияОбработкаВыбора(Объект, Форма, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если Объект.Проведен И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "СчетДоверительногоУправления") <> ВыбранноеЗначение Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение счета ду возможно только для непроведенного документа - сначала отмените проведение документа");
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДатаОбработкаВыбора(Объект, Форма, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если Объект.Проведен И НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Дата")) <> НачалоДня(ВыбранноеЗначение) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение даты на другой день возможно только для непроведенного документа - сначала отмените проведение документа");
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВалютаВыбранноеЗначение, ВалютаТекущееЗначение, РасчетныйСчет) Экспорт
	
	Если ЗначениеЗаполнено(РасчетныйСчет) Тогда
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "Валюта");
	Иначе
		Возврат;	
	КонецЕсли;
	
	Если ВалютаВыбранноеЗначение <> ВалютаРасчетногоСчета Тогда
			
		Если Вопрос("Валюта " + ВалютаВыбранноеЗначение + " не соответствует валюте расчетного счёта " + ВалютаРасчетногоСчета + ". Расчетный счёт будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			РасчетныйСчет = Неопределено;			
		Иначе
			ВалютаВыбранноеЗначение = ВалютаТекущееЗначение;			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#Область ОБРАБОТКА_ОПОВЕЩЕНИЙ

// Процедура вызывается из модуля формы документов при обработки оповещения
//
// Параметры:
// 	Форма - Управляемая форма, для которой производится обработка оповещения
//	ДокументСсылка - Ссылка на документ формы
// 	ИмяСобытия - имя обрабатываемого события
//	Параметр - параметр, переданный в обработку оповещения
// 	Источник - источник, переданный в обработку оповещения
Процедура ОбработкаОповещенияФормыДокумента(Форма, ДокументСсылка, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ЗаписьАкцепта" Тогда
		ОбработатьОповещениеОбАкцепте(Форма, ДокументСсылка, Параметр);
	ИначеЕсли ИмяСобытия = "ВыполнениеЗадачиСогласования" И Форма.Элементы.Найти("КартаСогласования") <> Неопределено Тогда	
		
		Если Форма.Элементы.КартаСогласования.Видимость Тогда
		
			КартаСогласования = РаботаСДокументами.ПолучитьКартуСогласованияПорученияНаВыводАктивов(ДокументСсылка, Форма.Объект.Организация);
			Если КартаСогласования <> Неопределено Тогда 
				Форма.КартаСогласования = КартаСогласования;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	
	
// Процедура в формах документов обрабатывает оповещение о записи акцепта 
//
// Параметры:
// 	Форма - Управляемая форма, для которой производится обработка оповещения
//	ДокументСсылка - Ссылка на документ формы
//	Параметр - параметр, переданный в обработку оповещения
Процедура ОбработатьОповещениеОбАкцепте(Форма, ДокументСсылка, Параметр)
	
	// Нужно проверить модифицированную форму акцептуемого документа
	// и перечитать данные в ней, чтобы избежать ошибки
	Если Не Форма.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	//Проверяем случаи, когда в параметрах Структура
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда		
		Возврат;
	КонецЕсли;
		
	ОбъектАкцептования = Неопределено;
	Параметр.Свойство("ОбъектАкцептования", ОбъектАкцептования);
	
	// Проверять нечего
	Если ОбъектАкцептования = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	// Формы незаписанных документов не проверяем
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
		
	// Два варианта объекта акцептования: либо строка банковской выписки, связанная с документом, либо сам документ 	
	СписокДокументов = Новый СписокЗначений;
	
	// Для строки банковской выписки нужно найти документ движения ДС	
	Если ТипЗнч(ОбъектАкцептования) = Тип("ДокументСсылка.СтрокаБанковскойВыписки") Тогда
		СписокДокументов = РаботаСДокументами.ПолучитьДвиженияДенежныхСредствПоСтрокеБанковскойВыписки(ОбъектАкцептования);
	Иначе
		СписокДокументов.Добавить(ОбъектАкцептования);
	КонецЕсли;	
	
	// Оповещение предназначено не для этого документа
	Если СписокДокументов.НайтиПоЗначению(ДокументСсылка) = Неопределено Тогда  		
		Возврат;
	КонецЕсли;
	                                   	
	Предупреждение("Изменена открытая форма документа " + СокрЛП(ДокументСсылка) + ". После проведения акцепта данные в форме будут обновлены");
	
	Форма.Прочитать();
	
КонецПроцедуры

#КонецОбласти

// Открывает форму объекта бизнес процесса из карты маршрута на форме поручения
//
//	Параметры:
//		- ДокументСсылка - ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств, ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг
//		- ТочкаМаршрута - Точка маршрута бизнес процесса
//

Процедура ПоказатьОбъектБизнесПроцессаСогласованияПорученийНаВыводАктивов(ДокументСсылка, ТочкаМаршрута) Экспорт
	
	Если ТипЗнч(ТочкаМаршрута) <> Тип("ТочкаМаршрутаБизнесПроцессаСсылка.СогласованиеПорученийНаВыводАктивов")
		Или ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.Слияние")
		Или ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.Разделение") Тогда 
		Возврат;
	КонецЕсли;
		
	СсылкаНаОбъект = РаботаСБизнесПроцессамиИЗадачами.ПолучитьОбъектБизнесПроцессаСогласованияПорученияНаВыводАктивовПоДействию(ДокументСсылка, ТочкаМаршрута);
	
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.СогласованиеОтделомСопровожденияОпераций")
		Или ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.КонтрольОтделомСопровожденияОпераций")
		Или ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ПодтверждениеКлиентскогоОтдела") Тогда
		
		ОткрытьФорму("Задача.ЗадачаИсполнителя.ФормаОбъекта", Новый Структура("Ключ", СсылкаНаОбъект));
		
	ИначеЕсли ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.Старт")
		Или ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.Завершение") Тогда
		
		ОткрытьФорму("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.Форма.ФормаБизнесПроцесса", Новый Структура("Ключ", СсылкаНаОбъект));
		
	ИначеЕсли ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.СозданиеПроведениеАкцепта") Тогда
		
		ОткрытьФорму("Документ.Акцепт.Форма.ФормаДокумента", Новый Структура("Ключ", СсылкаНаОбъект));
		
	КонецЕсли;
			
КонецПроцедуры

// Функция определяет контрагента по значению реквизита формы "ТипПередачи"
// 0 - юр.физ.лицо счета ДУ (клиент)
// 1 - юр.физ.лицо Организации
//  
//
Функция ПолучитьКонтрагентаДляВводаВыводаАктивов(Дата, ТипПередачи, Организация, СчетДоверительногоУправления, Основание = Неопределено) Экспорт
		
	Если ТипПередачи = 0 Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") И ЗначениеЗаполнено(Основание) Тогда
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Пайщик");	
		ИначеЕсли ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
			Возврат РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(СчетДоверительногоУправления, Дата);
		Иначе
			Возврат ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли ТипПередачи = 1 Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо");
	ИначеЕсли ТипПередачи = 2 Тогда	
		Возврат ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");		
	КонецЕсли;
	
КонецФункции
